

export const autoGovernment = [{
        "id": 2,
        "name": "北京",
        "children": 0
    },
    {
        "id": 26,
        "name": "天津",
        "children": 0
    },
    {
        "id": 24,
        "name": "上海",
        "children": 0
    },
    {
        "id": 31,
        "name": "重庆",
        "children": 0
    }
    ];
    export const citys = {
    "1": [
        {
            "name": "合肥",
            "id": 101
        },
        {
            "name": "安庆",
            "id": 102
        },
        {
            "name": "蚌埠",
            "id": 103
        },
        {
            "name": "巢湖",
            "id": 104
        },
        {
            "name": "池州",
            "id": 105
        },
        {
            "name": "阜阳",
            "id": 106
        },
        {
            "name": "淮北",
            "id": 107
        },
        {
            "name": "淮南",
            "id": 108
        },
        {
            "name": "六安",
            "id": 109
        },
        {
            "name": "马鞍山",
            "id": 110
        },
        {
            "name": "铜陵",
            "id": 113
        },
        {
            "name": "芜湖",
            "id": 114
        },
        {
            "name": "宣城",
            "id": 115
        },
        {
            "name": "滁州",
            "id": 116
        },
        {
            "name": "黄山",
            "id": 118
        },
        {
            "name": "宿州",
            "id": 120
        },
        {
            "name": "亳州",
            "id": 125
        }
    ],
    "3": [
        {
            "name": "福州",
            "id": 301
        },
        {
            "name": "厦门",
            "id": 302
        },
        {
            "name": "龙岩",
            "id": 303
        },
        {
            "name": "漳州",
            "id": 305
        },
        {
            "name": "莆田",
            "id": 306
        },
        {
            "name": "泉州",
            "id": 307
        },
        {
            "name": "南平",
            "id": 314
        },
        {
            "name": "宁德",
            "id": 315
        },
        {
            "name": "三明",
            "id": 318
        }
    ],
    "4": [
        {
            "name": "兰州",
            "id": 401
        },
        {
            "name": "定西",
            "id": 402
        },
        {
            "name": "平凉",
            "id": 405
        },
        {
            "name": "酒泉",
            "id": 409
        },
        {
            "name": "张掖",
            "id": 410
        },
        {
            "name": "庆阳",
            "id": 411
        },
        {
            "name": "武威",
            "id": 412
        },
        {
            "name": "天水",
            "id": 415
        },
        {
            "name": "嘉峪关",
            "id": 416
        },
        {
            "name": "金昌",
            "id": 417
        },
        {
            "name": "白银",
            "id": 418
        },
        {
            "name": "陇南",
            "id": 421
        },
        {
            "name": "甘南",
            "id": 422
        },
        {
            "name": "临夏",
            "id": 622900
        }
    ],
    "5": [
        {
            "name": "广州",
            "id": 501
        },
        {
            "name": "深圳",
            "id": 502
        },
        {
            "name": "珠海",
            "id": 503
        },
        {
            "name": "东莞",
            "id": 504
        },
        {
            "name": "中山",
            "id": 505
        },
        {
            "name": "汕头",
            "id": 507
        },
        {
            "name": "潮州",
            "id": 510
        },
        {
            "name": "韶关",
            "id": 511
        },
        {
            "name": "湛江",
            "id": 513
        },
        {
            "name": "肇庆",
            "id": 514
        },
        {
            "name": "茂名",
            "id": 515
        },
        {
            "name": "梅州",
            "id": 516
        },
        {
            "name": "佛山",
            "id": 518
        },
        {
            "name": "惠州",
            "id": 520
        },
        {
            "name": "江门",
            "id": 521
        },
        {
            "name": "揭阳",
            "id": 522
        },
        {
            "name": "清远",
            "id": 524
        },
        {
            "name": "云浮",
            "id": 528
        },
        {
            "name": "阳江",
            "id": 532
        },
        {
            "name": "河源",
            "id": 535
        },
        {
            "name": "汕尾",
            "id": 552
        }
    ],
    "6": [
        {
            "name": "南宁",
            "id": 601
        },
        {
            "name": "柳州",
            "id": 602
        },
        {
            "name": "桂林",
            "id": 603
        },
        {
            "name": "北海",
            "id": 604
        },
        {
            "name": "百色",
            "id": 605
        },
        {
            "name": "贺州",
            "id": 606
        },
        {
            "name": "河池",
            "id": 607
        },
        {
            "name": "贵港",
            "id": 608
        },
        {
            "name": "玉林",
            "id": 610
        },
        {
            "name": "钦州",
            "id": 612
        },
        {
            "name": "梧州",
            "id": 613
        },
        {
            "name": "防城港",
            "id": 615
        },
        {
            "name": "来宾",
            "id": 619
        },
        {
            "name": "崇左",
            "id": 621
        }
    ],
    "7": [
        {
            "name": "贵阳",
            "id": 701
        },
        {
            "name": "遵义",
            "id": 702
        },
        {
            "name": "安顺",
            "id": 705
        },
        {
            "name": "六盘水",
            "id": 708
        },
        {
            "name": "黔东南",
            "id": 714
        },
        {
            "name": "黔南",
            "id": 715
        },
        {
            "name": "黔西南",
            "id": 718
        },
        {
            "name": "毕节市",
            "id": 520502
        },
        {
            "name": "铜仁市",
            "id": 520602
        }
    ],
    "8": [
        {
            "name": "海口",
            "id": 801
        },
        {
            "name": "三亚",
            "id": 803
        },
        {
            "name": "海南直辖",
            "id": 469000
        }
    ],
    "9": [
        {
            "name": "石家庄",
            "id": 901
        },
        {
            "name": "唐山",
            "id": 902
        },
        {
            "name": "邢台",
            "id": 903
        },
        {
            "name": "秦皇岛",
            "id": 905
        },
        {
            "name": "廊坊",
            "id": 906
        },
        {
            "name": "邯郸",
            "id": 907
        },
        {
            "name": "衡水",
            "id": 908
        },
        {
            "name": "沧州",
            "id": 909
        },
        {
            "name": "保定",
            "id": 910
        },
        {
            "name": "张家口",
            "id": 911
        },
        {
            "name": "承德",
            "id": 912
        }
    ],
    "10": [
        {
            "name": "郑州",
            "id": 1001
        },
        {
            "name": "洛阳",
            "id": 1002
        },
        {
            "name": "周口",
            "id": 1003
        },
        {
            "name": "信阳",
            "id": 1004
        },
        {
            "name": "新乡",
            "id": 1005
        },
        {
            "name": "商丘",
            "id": 1006
        },
        {
            "name": "三门峡",
            "id": 1007
        },
        {
            "name": "濮阳",
            "id": 1008
        },
        {
            "name": "南阳",
            "id": 1009
        },
        {
            "name": "漯河",
            "id": 1010
        },
        {
            "name": "焦作",
            "id": 1011
        },
        {
            "name": "开封",
            "id": 1013
        },
        {
            "name": "安阳",
            "id": 1014
        },
        {
            "name": "鹤壁",
            "id": 1016
        },
        {
            "name": "平顶山",
            "id": 1018
        },
        {
            "name": "驻马店",
            "id": 1021
        },
        {
            "name": "许昌",
            "id": 1023
        },
        {
            "name": "河南直辖",
            "id": 419000
        }
    ],
    "11": [
        {
            "name": "哈尔滨",
            "id": 1101
        },
        {
            "name": "大庆",
            "id": 1102
        },
        {
            "name": "齐齐哈尔",
            "id": 1103
        },
        {
            "name": "鹤岗",
            "id": 1104
        },
        {
            "name": "佳木斯",
            "id": 1106
        },
        {
            "name": "鸡西",
            "id": 1107
        },
        {
            "name": "牡丹江",
            "id": 1108
        },
        {
            "name": "七台河",
            "id": 1109
        },
        {
            "name": "伊春",
            "id": 1112
        },
        {
            "name": "黑河",
            "id": 1113
        },
        {
            "name": "双鸭山",
            "id": 1123
        },
        {
            "name": "绥化",
            "id": 1131
        },
        {
            "name": "大兴安岭",
            "id": 1136
        }
    ],
    "12": [
        {
            "name": "武汉",
            "id": 1201
        },
        {
            "name": "十堰",
            "id": 1202
        },
        {
            "name": "襄阳",
            "id": 1203
        },
        {
            "name": "随州",
            "id": 1204
        },
        {
            "name": "宜昌",
            "id": 1207
        },
        {
            "name": "黄石",
            "id": 1208
        },
        {
            "name": "荆门",
            "id": 1209
        },
        {
            "name": "荆州",
            "id": 1210
        },
        {
            "name": "鄂州",
            "id": 1216
        },
        {
            "name": "咸宁",
            "id": 1217
        },
        {
            "name": "孝感",
            "id": 1229
        },
        {
            "name": "黄冈",
            "id": 1236
        },
        {
            "name": "恩施",
            "id": 422800
        },
        {
            "name": "湖北直辖",
            "id": 429000
        }
    ],
    "13": [
        {
            "name": "长沙",
            "id": 1301
        },
        {
            "name": "郴州",
            "id": 1302
        },
        {
            "name": "常德",
            "id": 1303
        },
        {
            "name": "衡阳",
            "id": 1304
        },
        {
            "name": "怀化",
            "id": 1305
        },
        {
            "name": "娄底",
            "id": 1306
        },
        {
            "name": "株洲",
            "id": 1307
        },
        {
            "name": "岳阳",
            "id": 1308
        },
        {
            "name": "湘潭",
            "id": 1309
        },
        {
            "name": "邵阳",
            "id": 1310
        },
        {
            "name": "永州",
            "id": 1312
        },
        {
            "name": "益阳",
            "id": 1313
        },
        {
            "name": "张家界",
            "id": 1315
        },
        {
            "name": "湘西",
            "id": 1333
        }
    ],
    "14": [
        {
            "name": "长春",
            "id": 1401
        },
        {
            "name": "吉林",
            "id": 1402
        },
        {
            "name": "通化",
            "id": 1403
        },
        {
            "name": "辽源",
            "id": 1405
        },
        {
            "name": "白山",
            "id": 1406
        },
        {
            "name": "白城",
            "id": 1412
        },
        {
            "name": "松原",
            "id": 1425
        },
        {
            "name": "延边",
            "id": 1428
        },
        {
            "name": "四平",
            "id": 1616
        }
    ],
    "15": [
        {
            "name": "南京",
            "id": 1501
        },
        {
            "name": "苏州",
            "id": 1502
        },
        {
            "name": "无锡",
            "id": 1503
        },
        {
            "name": "常州",
            "id": 1505
        },
        {
            "name": "淮安",
            "id": 1507
        },
        {
            "name": "连云港",
            "id": 1510
        },
        {
            "name": "南通",
            "id": 1511
        },
        {
            "name": "盐城",
            "id": 1512
        },
        {
            "name": "扬州",
            "id": 1513
        },
        {
            "name": "镇江",
            "id": 1515
        },
        {
            "name": "泰州",
            "id": 1517
        },
        {
            "name": "徐州",
            "id": 1518
        },
        {
            "name": "宿迁",
            "id": 1520
        }
    ],
    "16": [
        {
            "name": "南昌",
            "id": 1601
        },
        {
            "name": "上饶",
            "id": 1602
        },
        {
            "name": "萍乡",
            "id": 1603
        },
        {
            "name": "新余",
            "id": 1604
        },
        {
            "name": "宜春",
            "id": 1605
        },
        {
            "name": "九江",
            "id": 1606
        },
        {
            "name": "赣州",
            "id": 1607
        },
        {
            "name": "吉安",
            "id": 1609
        },
        {
            "name": "景德镇",
            "id": 1612
        },
        {
            "name": "抚州",
            "id": 1613
        },
        {
            "name": "鹰潭",
            "id": 1615
        }
    ],
    "17": [
        {
            "name": "沈阳",
            "id": 1701
        },
        {
            "name": "丹东",
            "id": 1702
        },
        {
            "name": "抚顺",
            "id": 1703
        },
        {
            "name": "阜新",
            "id": 1704
        },
        {
            "name": "葫芦岛",
            "id": 1705
        },
        {
            "name": "朝阳",
            "id": 1707
        },
        {
            "name": "大连",
            "id": 1708
        },
        {
            "name": "本溪",
            "id": 1709
        },
        {
            "name": "鞍山",
            "id": 1710
        },
        {
            "name": "锦州",
            "id": 1711
        },
        {
            "name": "辽阳",
            "id": 1713
        },
        {
            "name": "营口",
            "id": 1714
        },
        {
            "name": "盘锦",
            "id": 1716
        },
        {
            "name": "铁岭",
            "id": 1717
        }
    ],
    "18": [
        {
            "name": "呼和浩特",
            "id": 1801
        },
        {
            "name": "包头",
            "id": 1802
        },
        {
            "name": "赤峰",
            "id": 1803
        },
        {
            "name": "通辽",
            "id": 1804
        },
        {
            "name": "乌海",
            "id": 1805
        },
        {
            "name": "鄂尔多斯",
            "id": 1808
        },
        {
            "name": "呼伦贝尔",
            "id": 1812
        },
        {
            "name": "兴安盟",
            "id": 1814
        },
        {
            "name": "巴彦淖尔",
            "id": 1824
        },
        {
            "name": "乌兰察布",
            "id": 1825
        },
        {
            "name": "锡林郭勒",
            "id": 1829
        },
        {
            "name": "阿拉善盟",
            "id": 1830
        }
    ],
    "19": [
        {
            "name": "银川",
            "id": 1901
        },
        {
            "name": "吴忠",
            "id": 1902
        },
        {
            "name": "固原",
            "id": 1903
        },
        {
            "name": "石嘴山",
            "id": 1905
        },
        {
            "name": "中卫",
            "id": 1907
        }
    ],
    "20": [
        {
            "name": "西宁",
            "id": 2001
        },
        {
            "name": "海北",
            "id": 2023
        },
        {
            "name": "黄南",
            "id": 2024
        },
        {
            "name": "果洛",
            "id": 2025
        },
        {
            "name": "玉树",
            "id": 2026
        },
        {
            "name": "海西",
            "id": 2027
        },
        {
            "name": "海东",
            "id": 2029
        },
        {
            "name": "海南",
            "id": 2030
        }
    ],
    "21": [
        {
            "name": "德州",
            "id": 1015
        },
        {
            "name": "济南",
            "id": 2101
        },
        {
            "name": "青岛",
            "id": 2102
        },
        {
            "name": "烟台",
            "id": 2103
        },
        {
            "name": "威海",
            "id": 2104
        },
        {
            "name": "潍坊",
            "id": 2105
        },
        {
            "name": "泰安",
            "id": 2106
        },
        {
            "name": "枣庄",
            "id": 2107
        },
        {
            "name": "淄博",
            "id": 2109
        },
        {
            "name": "东营",
            "id": 2110
        },
        {
            "name": "菏泽",
            "id": 2112
        },
        {
            "name": "滨州",
            "id": 2113
        },
        {
            "name": "聊城",
            "id": 2114
        },
        {
            "name": "临沂",
            "id": 2117
        },
        {
            "name": "济宁",
            "id": 2118
        },
        {
            "name": "日照",
            "id": 2120
        },
        {
            "name": "莱芜",
            "id": 2132
        }
    ],
    "22": [
        {
            "name": "太原",
            "id": 2201
        },
        {
            "name": "大同",
            "id": 2202
        },
        {
            "name": "晋城",
            "id": 2203
        },
        {
            "name": "晋中",
            "id": 2204
        },
        {
            "name": "临汾",
            "id": 2205
        },
        {
            "name": "长治",
            "id": 2206
        },
        {
            "name": "运城",
            "id": 2207
        },
        {
            "name": "忻州",
            "id": 2210
        },
        {
            "name": "阳泉",
            "id": 2218
        },
        {
            "name": "朔州",
            "id": 2219
        },
        {
            "name": "吕梁",
            "id": 2227
        }
    ],
    "23": [
        {
            "name": "西安",
            "id": 2301
        },
        {
            "name": "咸阳",
            "id": 2302
        },
        {
            "name": "渭南",
            "id": 2303
        },
        {
            "name": "榆林",
            "id": 2304
        },
        {
            "name": "宝鸡",
            "id": 2305
        },
        {
            "name": "安康",
            "id": 2306
        },
        {
            "name": "汉中",
            "id": 2307
        },
        {
            "name": "延安",
            "id": 2308
        },
        {
            "name": "铜川",
            "id": 2310
        },
        {
            "name": "商洛",
            "id": 2313
        }
    ],
    "25": [
        {
            "name": "成都",
            "id": 2501
        },
        {
            "name": "绵阳",
            "id": 2502
        },
        {
            "name": "遂宁",
            "id": 2503
        },
        {
            "name": "攀枝花",
            "id": 2504
        },
        {
            "name": "宜宾",
            "id": 2506
        },
        {
            "name": "雅安",
            "id": 2507
        },
        {
            "name": "自贡",
            "id": 2508
        },
        {
            "name": "资阳",
            "id": 2509
        },
        {
            "name": "广元",
            "id": 2510
        },
        {
            "name": "德阳",
            "id": 2511
        },
        {
            "name": "乐山",
            "id": 2512
        },
        {
            "name": "南充",
            "id": 2513
        },
        {
            "name": "眉山",
            "id": 2514
        },
        {
            "name": "巴中",
            "id": 2516
        },
        {
            "name": "泸州",
            "id": 2517
        },
        {
            "name": "内江",
            "id": 2519
        },
        {
            "name": "广安",
            "id": 2530
        },
        {
            "name": "达州",
            "id": 2532
        },
        {
            "name": "阿坝",
            "id": 2535
        },
        {
            "name": "甘孜",
            "id": 2536
        },
        {
            "name": "凉山",
            "id": 2537
        }
    ],
    "27": [
        {
            "name": "拉萨",
            "id": 2701
        },
        {
            "name": "日喀则",
            "id": 2703
        },
        {
            "name": "山南",
            "id": 2704
        },
        {
            "name": "那曲",
            "id": 2705
        },
        {
            "name": "阿里",
            "id": 2707
        },
        {
            "name": "昌都",
            "id": 2709
        },
        {
            "name": "林芝",
            "id": 2710
        }
    ],
    "28": [
        {
            "name": "乌鲁木齐",
            "id": 2801
        },
        {
            "name": "克拉玛依",
            "id": 2803
        },
        {
            "name": "博尔塔拉",
            "id": 2821
        },
        {
            "name": "巴音郭楞",
            "id": 2822
        },
        {
            "name": "伊犁",
            "id": 2823
        },
        {
            "name": "阿克苏",
            "id": 2829
        },
        {
            "name": "新疆克州",
            "id": 2835
        },
        {
            "name": "吐鲁番市",
            "id": 650402
        },
        {
            "name": "哈密市",
            "id": 650502
        },
        {
            "name": "昌吉",
            "id": 652300
        },
        {
            "name": "喀什市",
            "id": 653101
        },
        {
            "name": "和田县",
            "id": 653221
        },
        {
            "name": "塔城市",
            "id": 654201
        },
        {
            "name": "阿勒泰市",
            "id": 654301
        },
        {
            "name": "新疆直辖",
            "id": 659000
        }
    ],
    "29": [
        {
            "name": "昆明",
            "id": 2901
        },
        {
            "name": "玉溪",
            "id": 2902
        },
        {
            "name": "曲靖",
            "id": 2903
        },
        {
            "name": "保山",
            "id": 2907
        },
        {
            "name": "临沧",
            "id": 2911
        },
        {
            "name": "文山",
            "id": 2914
        },
        {
            "name": "西双版纳",
            "id": 2915
        },
        {
            "name": "昭通",
            "id": 2918
        },
        {
            "name": "丽江",
            "id": 2922
        },
        {
            "name": "红河",
            "id": 2923
        },
        {
            "name": "德宏",
            "id": 2925
        },
        {
            "name": "怒江",
            "id": 2927
        },
        {
            "name": "迪庆",
            "id": 2928
        },
        {
            "name": "普洱",
            "id": 2929
        },
        {
            "name": "楚雄",
            "id": 532300
        },
        {
            "name": "大理",
            "id": 532900
        }
    ],
    "30": [
        {
            "name": "杭州",
            "id": 3001
        },
        {
            "name": "宁波",
            "id": 3002
        },
        {
            "name": "温州",
            "id": 3003
        },
        {
            "name": "嘉兴",
            "id": 3005
        },
        {
            "name": "金华",
            "id": 3006
        },
        {
            "name": "丽水",
            "id": 3009
        },
        {
            "name": "湖州",
            "id": 3011
        },
        {
            "name": "衢州",
            "id": 3012
        },
        {
            "name": "台州",
            "id": 3015
        },
        {
            "name": "绍兴",
            "id": 3016
        },
        {
            "name": "舟山",
            "id": 3020
        }
    ]
}

// module.exports = {
//     provinces: provinces,//省
//     autoGovernment: autoGovernment,//直辖市
//     citys: citys
// };
